espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
/***************************************************************************//**
 * @file
 * @brief Object Transfer Service Object Server implementation
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include "sl_bt_ots_server.h"
#include "sl_bt_ots_server_instances.h"
#include "sli_bt_ots_datatypes.h"
#include "sl_status.h"

#define OTS_L2CAP_MAX_PDU       250
#define OTS_L2CAP_MAX_SDU       252
#define OTS_L2CAP_SDU_PDU_DIFF  (OTS_L2CAP_MAX_SDU - OTS_L2CAP_MAX_PDU)

#define OTS_SERVER_BUFFER_SIZE        255

#define OACP_MESSAGE_LENGTH_CREATE_16           sizeof(sl_bt_ots_oacp_opcode_t) + sizeof(uint32_t) + SL_BT_OTS_UUID_SIZE_16
#define OACP_MESSAGE_LENGTH_CREATE_128          sizeof(sl_bt_ots_oacp_opcode_t) + sizeof(uint32_t) + SL_BT_OTS_UUID_SIZE_128
#define OACP_MESSAGE_LENGTH_DELETE              sizeof(sl_bt_ots_oacp_opcode_t)
#define OACP_MESSAGE_LENGTH_CALCULATE_CHECKSUM  sizeof(sl_bt_ots_oacp_opcode_t) + (sizeof(sl_bt_ots_oacp_calculate_checksum_parameters_t))
#define OACP_MESSAGE_LENGTH_EXECUTE_MIN         sizeof(sl_bt_ots_oacp_opcode_t)
#define OACP_MESSAGE_LENGTH_READ                sizeof(sl_bt_ots_oacp_opcode_t) + (sizeof(sl_bt_ots_oacp_read_parameters_t))
#define OACP_MESSAGE_LENGTH_WRITE               sizeof(sl_bt_ots_oacp_opcode_t) + (sizeof(sl_bt_ots_oacp_write_parameters_t))
#define OACP_MESSAGE_LENGTH_ABORT               sizeof(sl_bt_ots_oacp_opcode_t)
#define OACP_MESSAGE_LENGTH_RESPONSE_CODE       sizeof(sl_bt_ots_oacp_opcode_t)

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS
#define OLCP_MESSAGE_LENGTH_GO_TO      sizeof(sl_bt_ots_olcp_opcode_t) + sizeof(sl_bt_ots_object_id_complete_t)
#define OLCP_MESSAGE_LENGTH_ORDER      sizeof(sl_bt_ots_olcp_opcode_t) + sizeof(sl_bt_ots_olcp_order_parameters_t)
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS

#define CALL_SAFE(handle, cb, ...)      \
  if (handle->callbacks->cb != NULL) {  \
    handle->callbacks->cb(__VA_ARGS__); \
  }

// -----------------------------------------------------------------------------
// Type definitions

/// Type for indication queue
typedef struct {
  uint8_t  connection;
  uint16_t gattdb_handle;
  uint8_t  data_length;
  uint8_t  data[SL_BT_OTS_SERVER_CONFIG_INDICATION_SIZE_MAX];
} indication_queue_item_t;

// -----------------------------------------------------------------------------
// Forward declaration of private functions

// L2CAP transfer callback for data transmit
static void l2cap_transfer_data_transmit_server(sl_bt_l2cap_transfer_transfer_handle_t transfer_object,
                                                uint32_t                               offset,
                                                uint32_t                               size,
                                                uint8_t                                **data,
                                                uint32_t                               *data_size);

// L2CAP transfer callback for data reception
static uint16_t l2cap_transfer_data_received_server(sl_bt_l2cap_transfer_transfer_handle_t transfer_object,
                                                    uint32_t                               offset,
                                                    uint8array                             *data);

// L2CAP transfer callback for transfer finish
static void l2cap_transfer_transfer_finished_server(sl_bt_l2cap_transfer_transfer_handle_t transfer_object,
                                                    sl_status_t error_code);

// L2CAP transfer callback for channel open
static void l2cap_transfer_channel_opened_server(sl_bt_l2cap_transfer_transfer_handle_t transfer_object);

// Utilities
static sl_bt_ots_server_client_db_entry_t *find_client(sl_bt_ots_server_t *server, uint8_t connection_handle);

static sl_bt_ots_server_client_db_entry_t *find_client_by_transfer(sl_bt_ots_server_t *server, sl_bt_l2cap_transfer_transfer_handle_t transfer);

static sl_bt_ots_characteristic_uuid_index find_characteristic_index(uint16_t handle,
                                                                     sl_bt_ots_server_t **server);
static bool check_object_valid(sl_bt_ots_object_id_t *object);
static void set_object_invalid(sl_bt_ots_object_id_t *object);

// Connection handling
static void client_disconnected(uint16_t connection);
static void client_connected(uint16_t connection);

// GATT reads
static void handle_gatt_read(sl_bt_evt_gatt_server_user_read_request_t *read_request);
static uint8_t handle_metadata_read(sl_bt_ots_server_t *server,
                                    sl_bt_ots_server_client_db_entry_t *client,
                                    sl_bt_ots_characteristic_uuid_index characteristic_index);

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT
static uint8_t handle_filter_read(sl_bt_ots_server_t *server,
                                  sl_bt_ots_server_client_db_entry_t *client);
static uint8_t handle_filter_write(sl_bt_ots_server_t *server,
                                   sl_bt_ots_server_client_db_entry_t *client,
                                   sl_bt_evt_gatt_server_user_write_request_t *write_request);
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT

