espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
// GATT Writes
static void handle_gatt_write(sl_bt_evt_gatt_server_user_write_request_t *write_request);
static uint8_t handle_metadata_write(sl_bt_ots_server_t *server,
                                     sl_bt_ots_server_client_db_entry_t *client,
                                     sl_bt_ots_characteristic_uuid_index characteristic_index,
                                     sl_bt_evt_gatt_server_user_write_request_t *write_request);

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS
static uint8_t handle_olcp_write(sl_bt_ots_server_t *server,
                                 sl_bt_ots_server_client_db_entry_t *client,
                                 sl_bt_evt_gatt_server_user_write_request_t *write_request);
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS

static uint8_t handle_oacp_write(sl_bt_ots_server_t *server,
                                 sl_bt_ots_server_client_db_entry_t *client,
                                 sl_bt_evt_gatt_server_user_write_request_t *write_request);

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
// Object change helpers
static sl_status_t send_object_changed(sl_bt_ots_server_handle_t        server,
                                       sl_bt_ots_object_id_t            *object,
                                       sl_bt_ots_object_changed_flags_t flags,
                                       uint16_t                         client);
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT

static void handle_cccd(sl_bt_evt_gatt_server_characteristic_status_t *characteristic_status);

// Queue management
static void clear_queue(uint8_t connection);

static sl_status_t send_indication(sl_bt_ots_server_client_db_entry_t *client_entry,
                                   uint8_t                            connection,
                                   uint16_t                           characteristic,
                                   size_t                             value_len,
                                   const uint8_t                      *value);

static bool transfer_is_in_progress(sl_bt_ots_server_handle_t        server,
                                    sl_bt_ots_object_id_t            *object);

// -----------------------------------------------------------------------------
// Private variables

// Callbacks for L2CAP Transfer
static sl_bt_l2cap_transfer_callbacks_t l2cap_transfer_callbacks_server = {
  .on_transmit = l2cap_transfer_data_transmit_server,
  .on_receive  = l2cap_transfer_data_received_server,
  .on_open     = l2cap_transfer_channel_opened_server,
  .on_finish   = l2cap_transfer_transfer_finished_server
};

// -----------------------------------------------------------------------------
// Public functions

sl_status_t sl_bt_ots_server_init(sl_bt_ots_server_handle_t    server,
                                  sl_bt_ots_gattdb_handles_t   *handles,
                                  sl_bt_ots_server_callbacks_t *callbacks)
{
  sl_status_t sc = SL_STATUS_OK;
  uint8_t i;

  // Check arguments
  CHECK_NULL(server);
  CHECK_NULL(handles);
  CHECK_NULL(callbacks);

  // Assign variables
  server->callbacks = callbacks;
  server->gattdb_handles = handles;

  // Initialize client database
  for (i = 0; i < server->concurrency; i++) {
    // Clear current object
    set_object_invalid(&server->client_db[i].current_object);
    // Clear connection handle
    server->client_db[i].connection_handle = INVALID_CONNECTION_HANDLE;
    // Clear subscription status
    server->client_db[i].subscription_status.data = SL_BT_OTS_SUBSCRIPTION_STATUS_NONE;
    // Add transfer callbacks
    server->client_db[i].l2cap_transfer.callbacks = &l2cap_transfer_callbacks_server;
    // Set L2CAP inactive
    server->client_db[i].l2cap_transfer.mode = SL_BT_L2CAP_TRANSFER_MODE_INACTIVE;
    // Set current object properties
    server->client_db[i].current_object_properties = NULL;
    // Set current object properties
    server->client_db[i].current_object_size = NULL;
  }

  if (server->capability_init != NULL) {
    server->capability_init();
  }

  return sc;
}

sl_status_t sl_bt_ots_server_set_current_object(sl_bt_ots_server_handle_t     server,
                                                uint16_t                      client,
                                                sl_bt_ots_object_id_t         *object,
                                                sl_bt_ots_object_properties_t *properties,
                                                sl_bt_ots_object_size_t       *size)
{
  uint8_t i;
  // Check arguments
  CHECK_NULL(server);

  // Search for client in client database
  for (i = 0; i < server->concurrency; i++) {
    // Set client if found
    if (server->client_db[i].connection_handle == client) {
      // Check Object
      if (object == NULL) {
        // Set to invalid, if the object is NULL
        set_object_invalid(&server->client_db[i].current_object);
        // Set Object Properties to NULL
        server->client_db[i].current_object_properties = NULL;
        // Set Object Size to NULL
        server->client_db[i].current_object_size = NULL;
      } else {
        // Copy Object ID to Current Object ID
        memcpy(server->client_db[i].current_object.data,
               object->data,
               SL_BT_OTS_OBJECT_ID_SIZE);
        // Set Object Properties
        server->client_db[i].current_object_properties = properties;
        // Set Object Size
        server->client_db[i].current_object_size = size;
      }
      return SL_STATUS_OK;
    }
  }

  // Client not found
  return SL_STATUS_NOT_FOUND;
}

sl_status_t sl_bt_ots_server_get_current_object(sl_bt_ots_server_handle_t server,
                                                uint16_t                  client,
                                                sl_bt_ots_object_id_t     *object)
{
  uint8_t i;
  // Check arguments
  CHECK_NULL(server);
  CHECK_NULL(object);

  // Search for client in client database
  for (i = 0; i < server->concurrency; i++) {
    // Set client if found
    if (server->client_db[i].connection_handle == client) {
      memcpy(object->data,
             server->client_db[i].current_object.data,
             SL_BT_OTS_OBJECT_ID_SIZE);
      return SL_STATUS_OK;
    }
  }

  // Client not found
  return SL_STATUS_NOT_FOUND;
}

