espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
sl_status_t sl_bt_ots_server_abort(sl_bt_ots_server_handle_t server,
                                   uint16_t                  client)
{
  sl_bt_ots_server_client_db_entry_t *client_entry = NULL;

  // Check arguments
  CHECK_NULL(server);

  // Find client
  client_entry = find_client(server, client);

  // If client has found
  if (client_entry != NULL) {
    // If transfer in progress, abort and return
    return sl_bt_l2cap_transfer_abort_transfer(&client_entry->l2cap_transfer);
  }

  return SL_STATUS_NOT_FOUND;
}

sl_status_t sl_bt_ots_server_object_changed(sl_bt_ots_server_handle_t        server,
                                            sl_bt_ots_object_id_t            *object,
                                            sl_bt_ots_object_changed_flags_t flags)
{
  sl_status_t sc = SL_STATUS_NOT_SUPPORTED;

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
  // Clear flags as it is a server initiated change
  sl_bt_ots_object_changed_flags_t new_flags = flags & ~SL_BT_OTS_OBJECT_CHANGE_SOURCE_MASK;

  // Send indications to clients
  sc = send_object_changed(server, object, new_flags, INVALID_CONNECTION_HANDLE);
#else // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
  (void)server;
  (void)object;
  (void)flags;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT

  return sc;
}

sl_status_t sl_bt_ots_server_increase_credit(sl_bt_ots_server_handle_t server,
                                             uint16_t                  client,
                                             uint16_t                  credit)
{
  sl_bt_ots_server_client_db_entry_t *client_entry = NULL;
  sl_status_t sc = SL_STATUS_NOT_FOUND;

  // Check arguments
  CHECK_NULL(server);

  // Find client
  client_entry = find_client(server, client);

  if (client_entry != NULL) {
    // Check for transfer in progress
    sc = sl_bt_l2cap_transfer_check_progress(&client_entry->l2cap_transfer);
    if (sc == SL_STATUS_IN_PROGRESS) {
      sc = sl_bt_l2cap_transfer_increase_credit(&client_entry->l2cap_transfer, credit);
    } else {
      sc = SL_STATUS_INVALID_STATE;
    }
  }
  return sc;
}

// -----------------------------------------------------------------------------
// Event handlers

void sli_bt_ots_server_on_bt_event(sl_bt_msg_t *evt)
{
  switch (SL_BT_MSG_ID(evt->header)) {
    case sl_bt_evt_system_boot_id:
      break;
    case sl_bt_evt_connection_opened_id:
      // Connection opened
      client_connected(evt->data.evt_connection_opened.connection);
      break;
    case sl_bt_evt_connection_closed_id:
      // Connection closed
      client_disconnected(evt->data.evt_connection_closed.connection);
      break;
    case sl_bt_evt_gatt_server_user_read_request_id:
      // Handle read requests
      handle_gatt_read(&evt->data.evt_gatt_server_user_read_request);
      break;
    case sl_bt_evt_gatt_server_user_write_request_id:
      // Handle write requests
      handle_gatt_write(&evt->data.evt_gatt_server_user_write_request);
      break;
    case sl_bt_evt_gatt_server_characteristic_status_id:
      handle_cccd(&evt->data.evt_gatt_server_characteristic_status);
      break;
    case sl_bt_evt_gatt_server_indication_timeout_id:
      // Indication timed out
      break;
  }
}

void sli_bt_ots_server_step(void)
{
  sl_status_t sc;

  for (uint8_t s = 0; s < SL_BT_OTS_SERVER_COUNT; s++) {
    const sl_bt_ots_server_t *server = sl_bt_ots_server_instances[s];
    for (uint8_t index = 0; index < server->concurrency; index++) {
      app_queue_t queue = server->client_db[index].indication_queue;
      if (!app_queue_is_empty(&queue)) {
        // Send out the indication
        indication_queue_item_t item;
        CORE_DECLARE_IRQ_STATE;
        CORE_ENTER_CRITICAL();
        sc = app_queue_peek(&queue, (uint8_t *)&item);
        if (sc == SL_STATUS_OK) {
          // Calling from critical section
          sc = sl_bt_gatt_server_send_indication(item.connection,
                                                 item.gattdb_handle,
                                                 item.data_length,
                                                 item.data);
          if (sc == SL_STATUS_OK) {
            (void)app_queue_remove(&queue, (uint8_t *)&item);
          }
        }
        CORE_EXIT_CRITICAL();
      }
    }
  }
}

#ifdef SL_CATALOG_POWER_MANAGER_PRESENT

static bool server_has_task(void)
{
  for (uint8_t s = 0; s < SL_BT_OTS_SERVER_COUNT; s++) {
    const sl_bt_ots_server_t *server = sl_bt_ots_server_instances[s];
    for (uint8_t index = 0; index < server->concurrency; index++) {
      if (!app_queue_is_empty(&server->client_db[index].indication_queue)) {
        return true;
      }
    }
  }
  return false;
}

sl_power_manager_on_isr_exit_t sli_bt_ots_server_sleep_on_isr_exit(void)
{
  sl_power_manager_on_isr_exit_t ret = SL_POWER_MANAGER_IGNORE;
  if (server_has_task()) {
    ret = SL_POWER_MANAGER_WAKEUP;
  }
  return ret;
}

bool sli_bt_ots_server_is_ok_to_sleep(void)
{
  bool ret = true;
  if (server_has_task()) {
    ret = false;
  }
  return ret;
}

#endif // SL_CATALOG_POWER_MANAGER_PRESENT

// -----------------------------------------------------------------------------
// Private functions

// L2CAP transfer callback for data transmission
static void l2cap_transfer_data_transmit_server(sl_bt_l2cap_transfer_transfer_handle_t transfer_object,
                                                uint32_t                               offset,
                                                uint32_t                               size,
                                                uint8_t                                **data,
                                                uint32_t                               *data_size)
{
  uint8_t index = 0;
  sl_bt_ots_server_t *server = NULL;
  sl_bt_ots_server_client_db_entry_t *client = NULL;

  for (index = 0; index < SL_BT_OTS_SERVER_COUNT; index++) {
    server = (sl_bt_ots_server_t *)sl_bt_ots_server_instances[index];

