espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
    client = find_client_by_transfer(server, transfer_object);

    if (client != NULL) {
      CALL_SAFE(server,
                on_data_transmit,
                server,
                client->connection_handle,
                &client->current_object,
                offset,
                size,
                data,
                data_size);
    }
  }
}

// L2CAP transfer callback for data reception
static uint16_t l2cap_transfer_data_received_server(sl_bt_l2cap_transfer_transfer_handle_t transfer_object,
                                                    uint32_t                               offset,
                                                    uint8array                             *data)
{
  uint8_t index = 0;
  sl_bt_ots_server_t *server = NULL;
  sl_bt_ots_server_client_db_entry_t *client = NULL;

  for (index = 0; index < SL_BT_OTS_SERVER_COUNT; index++) {
    server = (sl_bt_ots_server_t *)sl_bt_ots_server_instances[index];

    client = find_client_by_transfer(server, transfer_object);

    if (client != NULL
        && (sl_bt_l2cap_transfer_transfer_t *)transfer_object == &client->l2cap_transfer
        && server->callbacks->on_data_received != NULL) {
      uint16_t credit = server->callbacks->on_data_received(server,
                                                            client->connection_handle,
                                                            &client->current_object,
                                                            offset,
                                                            data->data,
                                                            data->len);
      return credit;
    }
  }

  return 0;
}

// L2CAP transfer callback for transfer finish
static void l2cap_transfer_transfer_finished_server(sl_bt_l2cap_transfer_transfer_handle_t transfer_object,
                                                    sl_status_t                                   error_code)
{
  uint8_t index = 0;
  sl_bt_ots_server_t *server = NULL;
  sl_bt_ots_server_client_db_entry_t *client = NULL;

  sl_bt_ots_transfer_result_t result = SL_BT_OTS_TRANSFER_FINISHED_RESPONSE_CODE_SUCCESS;

  // Search for owner and call back
  for (index = 0; index < SL_BT_OTS_SERVER_COUNT; index++) {
    server = (sl_bt_ots_server_t *)sl_bt_ots_server_instances[index];
    client = find_client_by_transfer(server, transfer_object);

    if (error_code != SL_STATUS_OK) {
      result = SL_BT_OTS_TRANSFER_FINISHED_RESPONSE_CODE_CHANNEL_ERROR;
    }

    if (client != NULL) {
      CALL_SAFE(server,
                on_data_transfer_finished,
                server,
                client->connection_handle,
                &client->current_object,
                result);
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
      (void)send_object_changed(server,
                                &client->current_object,
                                SL_BT_OTS_OBJECT_CHANGE_SOURCE_MASK
                                | SL_BT_OTS_OBJECT_CHANGE_CONTENTS_MASK,
                                client->connection_handle);
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
    }
  }
}

// L2CAP transfer callback for channel open
static void l2cap_transfer_channel_opened_server(sl_bt_l2cap_transfer_transfer_handle_t transfer_object)
{
  (void)transfer_object;
}

static bool check_object_valid(sl_bt_ots_object_id_t *object)
{
  if (object == NULL) {
    return false;
  }
  // If usable data is not zero, ID is valid
  for (uint8_t i = 0; i < SL_BT_OTS_OBJECT_ID_USABLE_SIZE; i++) {
    if (object->id.usable[i] > 0) {
      return true;
    }
  }
  // If usable data is zero only, check for RFU
  return (object->id.rfu == 0);
}

static void set_object_invalid(sl_bt_ots_object_id_t *object)
{
  if (object != NULL) {
    // Initialize usable values
    memset(object->id.usable, 0, SL_BT_OTS_OBJECT_ID_USABLE_SIZE);
    // Set the RFU
    object->id.rfu = SL_BT_OTS_INVALID_OBJECT_RFU;
  }
}

static sl_bt_ots_characteristic_uuid_index find_characteristic_index(uint16_t handle,
                                                                     sl_bt_ots_server_t **server)
{
  *server = NULL;
  // Find handle on a server
  if (INVALID_CHARACTERISTIC_HANDLE == handle) {
    return SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_INVALID;
  }
  // Find handle on a server
  // Iterate over servers
  for (uint8_t s = 0; s < SL_BT_OTS_SERVER_COUNT; s++) {
    // Search in the handles
    for (uint8_t c = 0; c < SL_BT_OTS_CHARACTERISTIC_UUID_COUNT; c++) {
      if (sl_bt_ots_server_instances[s]->gattdb_handles->characteristics.array[c] == handle) {
        *server = (sl_bt_ots_server_t *)sl_bt_ots_server_instances[s];
        return (sl_bt_ots_characteristic_uuid_index)c;
      }
    }
  }
  return SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_INVALID;
}

static sl_bt_ots_server_client_db_entry_t *find_client(sl_bt_ots_server_t *server, uint8_t connection_handle)
{
  if (server != NULL) {
    for (uint8_t index = 0; index < server->concurrency; index++) {
      if (server->client_db[index].connection_handle == connection_handle) {
        return &server->client_db[index];
      }
    }
  }
  return NULL;
}

static sl_bt_ots_server_client_db_entry_t *find_client_by_transfer(sl_bt_ots_server_t *server, sl_bt_l2cap_transfer_transfer_handle_t transfer)
{
  if (server != NULL) {
    for (uint8_t index = 0; index < server->concurrency; index++) {
      if (&server->client_db[index].l2cap_transfer == (sl_bt_l2cap_transfer_transfer_t *)transfer) {
        return &server->client_db[index];
      }
    }
  }
  return NULL;
}

static void client_connected(uint16_t connection)
{
  // Assign the next client to servers
  for (uint8_t s = 0; s < SL_BT_OTS_SERVER_COUNT; s++) {
    // Check the status of the server
    if (sl_bt_ots_server_instances[s] != NULL
        && sl_bt_ots_server_instances[s]->callbacks != NULL) {
      sl_bt_ots_server_client_db_entry_t *client = find_client((sl_bt_ots_server_t *)sl_bt_ots_server_instances[s],
                                                               INVALID_CONNECTION_HANDLE);
      // Found an empty slot
      if (client != NULL) {
        // Set data
        client->connection_handle = connection;
        set_object_invalid(&client->current_object);
        client->subscription_status.data = SL_BT_OTS_SUBSCRIPTION_STATUS_NONE;
        // Call back
        if (sl_bt_ots_server_instances[s]->callbacks->on_client_connect) {
          sl_bt_ots_server_instances[s]->callbacks->on_client_connect((sl_bt_ots_server_t *)sl_bt_ots_server_instances[s],
                                                                      connection);
        }

        // Set up L2CAP transfer
        client->l2cap_transfer.connection = client->connection_handle;
      }
    }
  }
}

