espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
static void client_disconnected(uint16_t connection)
{
  for (uint8_t s = 0; s < SL_BT_OTS_SERVER_COUNT; s++) {
    sl_bt_ots_server_client_db_entry_t *client = find_client((sl_bt_ots_server_t *)sl_bt_ots_server_instances[s],
                                                             connection);
    if (client != NULL) {
      // Call back
      if (sl_bt_ots_server_instances[s]->callbacks->on_client_disconnect != NULL) {
        sl_bt_ots_server_instances[s]->callbacks->on_client_disconnect((sl_bt_ots_server_t *)sl_bt_ots_server_instances[s],
                                                                       connection);
      }

      // Abort transfer if it is in progress
      if (sl_bt_l2cap_transfer_check_progress(&client->l2cap_transfer)) {
        sl_bt_l2cap_transfer_abort_transfer(&client->l2cap_transfer);
      }

      // Clear client queue
      clear_queue(client->connection_handle);

      // Clear ID
      set_object_invalid(&client->current_object);

      // Clear client properties
      client->subscription_status.data = SL_BT_OTS_SUBSCRIPTION_STATUS_NONE;
      client->current_object_properties = NULL;
      client->current_object_size = NULL;
      client->l2cap_transfer_pdu = 0;
      client->l2cap_transfer_sdu = 0;

      // Remove client
      client->connection_handle = INVALID_CONNECTION_HANDLE;
    }
  }
}

static sl_status_t handle_feature_read(sl_bt_ots_server_t *server,
                                       sl_bt_ots_server_client_db_entry_t *client)
{
  sl_status_t sc;
  uint16_t sent_len;

  sc = sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                 server->gattdb_handles->characteristics.array[SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OTS_FEATURE],
                                                 ATT_ERR_SUCCESS,
                                                 sizeof(server->features),
                                                 (uint8_t *)&server->features,
                                                 &sent_len);
  return sc;
}

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT
static uint8_t handle_filter_read(sl_bt_ots_server_t *server,
                                  sl_bt_ots_server_client_db_entry_t *client)
{
  uint8_t att_error = ATT_ERR_SUCCESS;
  uint16_t sent_len;
  sl_bt_ots_object_list_filter_content_t filter;
  sl_status_t sc;
  uint8_t buffer[OTS_SERVER_BUFFER_SIZE];
  uint16_t length = 0;

  if (server->callbacks->on_object_list_filter_get != NULL) {
    sl_bt_ots_object_metadata_read_response_code_t response =
      server->callbacks->on_object_list_filter_get(server,
                                                   client->connection_handle,
                                                   &filter);
    if (response == ATT_ERR_SUCCESS) {
      buffer[0] = filter.filter_type;

      switch (filter.filter_type) {
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NO_FILTER:
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_MARKED_OBJECTS:
          // No params
          length = 0;
          break;
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NAME_CONTAINS:
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NAME_STARTS_WITH:
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NAME_ENDS_WITH:
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NAME_IS_EXACTLY:
          length = filter.parameters.name.length;
          // Copy data after type
          memcpy(&buffer[1], filter.parameters.name.name, length);
          break;
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_CREATED_BETWEEN:
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_MODIFIED_BETWEEN:
          length = sizeof(filter.parameters.time);
          memcpy(&buffer[1], &filter.parameters.time, length);
          break;
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_OBJECT_TYPE:
          if (filter.parameters.type.uuid_is_sig) {
            length = SL_BT_OTS_UUID_SIZE_16;
          } else {
            length = SL_BT_OTS_UUID_SIZE_128;
          }
          // Copy data after type
          memcpy(&buffer[1], filter.parameters.type.uuid_data, length);
          break;
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_CURRENT_SIZE_BETWEEN:
        case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_ALLOCATED_SIZE_BETWEEN:
          length = sizeof(filter.parameters.size);
          // Copy data after type
          memcpy(&buffer[1], &filter.parameters.size, length);
          break;
        default:
          break;
      }
      // Sent read response
      sc = sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                     server->gattdb_handles->characteristics.array[SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_LIST_FILTER],
                                                     ATT_ERR_SUCCESS,
                                                     length + 1,
                                                     (uint8_t *)buffer,
                                                     &sent_len);
      (void)sc;
    } else {
      if (response != ATT_ERR_SUCCESS) {
        att_error = response;
      } else {
        att_error = ATT_ERR_NOT_SUPPORTED;
      }
    }
  } else {
    // Not handled
    att_error = ATT_ERR_NOT_SUPPORTED;
  }

  return att_error;
}
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT

static uint8_t handle_metadata_read(sl_bt_ots_server_t *server,
                                    sl_bt_ots_server_client_db_entry_t *client,
                                    sl_bt_ots_characteristic_uuid_index characteristic_index)
{
  uint8_t att_error = ATT_ERR_SUCCESS;
  sl_bt_ots_object_metadata_read_parameters_t parameters;
  sl_bt_ots_object_metadata_read_event_type_t event;
  uint16_t sent_len;
  uint8_t len = 0;

  // Check if object is valid
  if (check_object_valid(&client->current_object)) {
    if (server->callbacks->on_object_metadata_read != NULL) {
      // Set event type
      event = (sl_bt_ots_object_metadata_read_event_type_t)characteristic_index;

      // Call back to higher layers
      sl_bt_ots_object_metadata_read_response_code_t response =
        server->callbacks->on_object_metadata_read(server,
                                                   client->connection_handle,
                                                   &client->current_object,
                                                   event,
                                                   &parameters);
      if (response == ATT_ERR_SUCCESS) {
        // Send read response for metadata
        switch (characteristic_index) {
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_NAME:
            (void)sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                            server->gattdb_handles->characteristics.array[characteristic_index],
                                                            ATT_ERR_SUCCESS,
                                                            parameters.object_name.length,
                                                            (uint8_t *)parameters.object_name.name,
                                                            &sent_len);
            break;
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_TYPE:
            len = SL_BT_OTS_UUID_SIZE_128;
            if ( parameters.object_type.uuid_is_sig ) {
              len = SL_BT_OTS_UUID_SIZE_16;
            }
            (void)sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                            server->gattdb_handles->characteristics.array[characteristic_index],
                                                            ATT_ERR_SUCCESS,
                                                            len,
                                                            (uint8_t *)parameters.object_type.uuid_data,
                                                            &sent_len);
            break;
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_SIZE:
            (void)sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                            server->gattdb_handles->characteristics.array[characteristic_index],
                                                            ATT_ERR_SUCCESS,
                                                            sizeof(parameters.object_size),
                                                            (uint8_t *)&parameters.object_size,
                                                            &sent_len);
            break;
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_FIRST_CREATED:
            if (server->capabilities.capability_time
                && server->capabilities.capability_first_created) {
              (void)sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                              server->gattdb_handles->characteristics.array[characteristic_index],
                                                              ATT_ERR_SUCCESS,
                                                              sizeof(parameters.object_first_created),
                                                              (uint8_t *)&parameters.object_first_created,
                                                              &sent_len);
            } else {
              att_error = ATT_ERR_NOT_SUPPORTED;
            }
            break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_LAST_MODIFIED:
            if (server->capabilities.capability_time
                && server->capabilities.capability_last_modified) {
              (void)sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                              server->gattdb_handles->characteristics.array[characteristic_index],
                                                              ATT_ERR_SUCCESS,
                                                              sizeof(parameters.object_last_modified),
                                                              (uint8_t *)&parameters.object_last_modified,
                                                              &sent_len);
            } else {
              att_error = ATT_ERR_NOT_SUPPORTED;
            }
            break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_ID:
            (void)sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                            server->gattdb_handles->characteristics.array[characteristic_index],
                                                            ATT_ERR_SUCCESS,
                                                            sizeof(parameters.object_id.data),
                                                            (uint8_t *)&parameters.object_id.data,
                                                            &sent_len);
            break;
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_PROPERTIES:
            (void)sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                            server->gattdb_handles->characteristics.array[characteristic_index],
                                                            ATT_ERR_SUCCESS,
                                                            sizeof(parameters.object_properties),
                                                            (uint8_t *)&parameters.object_properties,
                                                            &sent_len);
            break;
          default:
            att_error = ATT_ERR_ATTRIBUTE_NOT_FOUND;
            break;
        }
      } else {
        if (response != ATT_ERR_SUCCESS) {
          att_error = response;
        } else {
          att_error = ATT_ERR_NOT_SUPPORTED;
        }
      }
    } else {
      // No callback present
      att_error = ATT_ERR_NOT_SUPPORTED;
    }
  } else {
    // Object is not valid
    att_error = ATT_ERR_OBJECT_NOT_SELECTED;
  }
  return att_error;
}

static void handle_gatt_read(sl_bt_evt_gatt_server_user_read_request_t *read_request)
{
  sl_bt_ots_server_t *server = NULL;
  sl_bt_ots_server_client_db_entry_t *client = NULL;
  sl_bt_ots_characteristic_uuid_index characteristic_index =  SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_INVALID;
  uint8_t att_error = ATT_ERR_SUCCESS;

  // Find characteristic handle
  characteristic_index = find_characteristic_index(read_request->characteristic,
                                                   &server);
  // Check server hand characteristic index
  if (server != NULL && characteristic_index != SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_INVALID) {
    // Identify client
    client = find_client(server, read_request->connection);

    // check if client is found
    if (client != NULL) {
      switch (characteristic_index) {
        // Handle feature
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OTS_FEATURE:
          (void)handle_feature_read(server, client);
          break;
        // Handle metadata
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_NAME:
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_TYPE:
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_SIZE:
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_FIRST_CREATED:
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_LAST_MODIFIED:
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_ID:
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_PROPERTIES:
          att_error = handle_metadata_read(server,
                                           client,
                                           characteristic_index);
          break;
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT
        // Handle Object List Filter
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_LIST_FILTER:
          if (server->capabilities.capability_object_list_filter) {
            att_error = handle_filter_read(server, client);
          } else {
            att_error = ATT_ERR_NOT_SUPPORTED;
          }
          break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT
        default:
          att_error = ATT_ERR_ATTRIBUTE_NOT_FOUND;
          break;
      }
    }
  }
  if (att_error != ATT_ERR_SUCCESS) {
    sl_status_t sc;
    uint16_t sent_len;
    sc = sl_bt_gatt_server_send_user_read_response(client->connection_handle,
                                                   server->gattdb_handles->characteristics.array[SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OTS_FEATURE],
                                                   att_error,
                                                   0,
                                                   NULL,
                                                   &sent_len);
    (void)sc;
  }
}

