espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
static uint8_t handle_oacp_write(sl_bt_ots_server_t *server,
                                 sl_bt_ots_server_client_db_entry_t *client,
                                 sl_bt_evt_gatt_server_user_write_request_t *write_request)
{
  sl_bt_ots_oacp_response_code_t response_code = SL_BT_OTS_OACP_RESPONSE_CODE_SUCCESS;

  bool truncation_requested = false;
  bool patching_requested = false;

  // Return value for the function
  uint8_t sc = ATT_ERR_SUCCESS;

  // general message frame that will be forwarded to event handler
  sl_bt_ots_oacp_message_t *oacp_msg = ((sl_bt_ots_oacp_message_t *)write_request->value.data);
  sl_bt_ots_oacp_parameters_t oacp_msg_parameters;

  // Needed for checksum and execute response process
  sl_bt_ots_oacp_response_data_t oacp_response_data;
  uint8_t oacp_response_data_len = 0;
  // Buffer to initialize response message
  uint8_t buffer[SL_BT_OTS_SERVER_CONFIG_INDICATION_SIZE_MAX];
  // Needed for BLE indication message
  sl_bt_ots_oacp_response_message_t *oacp_response_msg = (sl_bt_ots_oacp_response_message_t *)buffer;

  // Message length is incorrect
  if (write_request->value.len < sizeof(sl_bt_ots_oacp_opcode_t)) {
    sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
    return sc;
  }

  // Object is not selected
  if (!check_object_valid(&client->current_object)) {
    sc = ATT_ERR_OBJECT_NOT_SELECTED;
    return sc;
  }
  if (!client->subscription_status.subscribed.oacp) {
    sc = ATT_ERR_IMPORER_CCCD;
    return sc;
  }

  uint8_t *data_pointer = (uint8_t *)&oacp_msg->opcode;
  data_pointer += sizeof(sl_bt_ots_oacp_opcode_t);

  switch (oacp_msg->opcode) {
    case SL_BT_OTS_OACP_OPCODE_CREATE:
      if ((server->features.oacp_features
           & (SL_BT_OTS_OACP_FEATURE_CREATE_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        break;
      }

      // Parameter length does are incorrect
      if (write_request->value.len != OACP_MESSAGE_LENGTH_CREATE_16
          && write_request->value.len != OACP_MESSAGE_LENGTH_CREATE_128) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }

      oacp_msg_parameters.create.size = *(uint32_t *)data_pointer;
      data_pointer += sizeof(oacp_msg_parameters.create.size);

      if (write_request->value.len == OACP_MESSAGE_LENGTH_CREATE_16) {
        memcpy(&oacp_msg_parameters.create.type, data_pointer, SL_BT_OTS_UUID_SIZE_16);
      } else if (write_request->value.len == OACP_MESSAGE_LENGTH_CREATE_128) {
        memcpy(&oacp_msg_parameters.create.type, data_pointer, SL_BT_OTS_UUID_SIZE_128);
      }

      // Check if it is used in another transfer on the server
      if (transfer_is_in_progress(server, &client->current_object)) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_OBJECT_LOCKED;
      }
      break;

    case SL_BT_OTS_OACP_OPCODE_DELETE:
      if ((server->features.oacp_features
           & (SL_BT_OTS_OACP_FEATURE_CREATE_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        break;
      }

      // Parameter length does are incorrect
      if (write_request->value.len != OACP_MESSAGE_LENGTH_DELETE) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }

      // Handle properties
      if (client->current_object_properties != NULL) {
        sl_bt_ots_object_properties_t properties = *client->current_object_properties;
        // Check if it is not writable
        if ( !(properties & SL_BT_OTS_OBJECT_PROPERTY_DELETE_MASK) ) {
          response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        }
      }

      break;

    case SL_BT_OTS_OACP_OPCODE_CALCULATE_CHECKSUM:
      if ((server->features.oacp_features
           & (SL_BT_OTS_OACP_FEATURE_CALCULATE_CHECKSUM_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        break;
      }

      // Parameters are incorrect
      if (write_request->value.len != OACP_MESSAGE_LENGTH_CALCULATE_CHECKSUM) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }

      oacp_msg_parameters.calculate_checksum.offset = *(uint32_t *)data_pointer;
      data_pointer += sizeof(oacp_msg_parameters.calculate_checksum.offset);

      oacp_msg_parameters.calculate_checksum.length = *(uint32_t *)data_pointer;

      if (oacp_msg_parameters.calculate_checksum.length == 0) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_INVALID_PARAMETER;
        break;
      }

      // Handle size conditions
      if (client->current_object_size != NULL) {
        // Check for overflow
        if ( (oacp_msg_parameters.calculate_checksum.offset
              + oacp_msg_parameters.calculate_checksum.length)
             > client->current_object_size->current_size) {
          response_code = SL_BT_OTS_OACP_RESPONSE_CODE_INVALID_PARAMETER;
          break;
        }
      }

      // Check if it is used in another transfer on the server
      if (transfer_is_in_progress(server, &client->current_object)) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_OBJECT_LOCKED;
      }

      break;

    case SL_BT_OTS_OACP_OPCODE_EXECUTE:
      if ((server->features.oacp_features
           & (SL_BT_OTS_OACP_FEATURE_EXECUTE_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        break;
      }

      // Handle properties
      if (client->current_object_properties != NULL) {
        sl_bt_ots_object_properties_t properties = *client->current_object_properties;
        // Check if it is not writable
        if ( !(properties & SL_BT_OTS_OBJECT_PROPERTY_EXECUTE_MASK) ) {
          response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
          break;
        }
      }

      memcpy(&oacp_msg_parameters.execute.data,
             data_pointer,
             write_request->value.len - sizeof(sl_bt_ots_oacp_opcode_t));

      break;

    case SL_BT_OTS_OACP_OPCODE_READ:
      if ((server->features.oacp_features
           & (SL_BT_OTS_OACP_FEATURE_READ_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        break;
      }

      // Parameter length does are incorrect
      if (write_request->value.len != OACP_MESSAGE_LENGTH_READ) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }

