espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
      oacp_msg_parameters.read.offset = *(uint32_t *)data_pointer;

      data_pointer += sizeof(oacp_msg_parameters.read.length);
      oacp_msg_parameters.read.length = *(uint32_t *)data_pointer;

      if (oacp_msg_parameters.read.length == 0) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_INVALID_PARAMETER;
        break;
      }

      // Handle properties
      if (client->current_object_properties != NULL) {
        sl_bt_ots_object_properties_t properties = *client->current_object_properties;
        // Check if it is not writable
        if ( !(properties & SL_BT_OTS_OBJECT_PROPERTY_READ_MASK) ) {
          response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
          break;
        }
      }

      // Handle size conditions
      if (client->current_object_size != NULL) {
        // Check for overflow
        if ( (oacp_msg_parameters.calculate_checksum.offset
              + oacp_msg_parameters.calculate_checksum.length)
             > client->current_object_size->current_size) {
          response_code = SL_BT_OTS_OACP_RESPONSE_CODE_INVALID_PARAMETER;
          break;
        }
      }

      // Check if it is used in another transfer on the server
      if (transfer_is_in_progress(server, &client->current_object)) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_OBJECT_LOCKED;
      }

      break;

    case SL_BT_OTS_OACP_OPCODE_WRITE:
      // Check if server supports write
      if (!(server->features.oacp_features
            & SL_BT_OTS_OACP_FEATURE_WRITE_OP_CODE_SUPPORTED_MASK)) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        break;
      }

      // Parameter length does are incorrect
      if (write_request->value.len != OACP_MESSAGE_LENGTH_WRITE) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }

      oacp_msg_parameters.write.offset = *(uint32_t *)data_pointer;

      data_pointer += sizeof(oacp_msg_parameters.write.offset);
      oacp_msg_parameters.write.length = *(uint32_t *)data_pointer;

      data_pointer += sizeof(oacp_msg_parameters.write.length);
      oacp_msg_parameters.write.mode = *(sl_bt_ots_oacp_write_mode_t *)data_pointer;

      truncation_requested = oacp_msg_parameters.write.mode
                             & SL_BT_OTS_WRITE_MODE_TRUNCATE_MASK;

      // Check if truncation specified but it is not supported by the server
      if (truncation_requested
          && !(server->features.oacp_features
               & SL_BT_OTS_OACP_FEATURE_TRUNCATION_OF_OBJECTS_SUPPORTED_MASK)) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        break;
      }

      // Check for zero length
      if (oacp_msg_parameters.write.length == 0u) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_INVALID_PARAMETER;
        break;
      }

      // Check for enabled RFU bits
      if (oacp_msg_parameters.write.mode & ~SL_BT_OTS_WRITE_MODE_TRUNCATE_MASK) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_INVALID_PARAMETER;
        break;
      }

      // Handle size conditions
      if (client->current_object_size != NULL) {
        // Check for overflow if appending is not allowed
        if (!(server->features.oacp_features
              & SL_BT_OTS_OACP_FEATURE_APPEND_ADDITIONAL_DATA_SUPPORTED_MASK)) {
          if ( (oacp_msg_parameters.calculate_checksum.offset
                + oacp_msg_parameters.calculate_checksum.length)
               > client->current_object_size->allocated_size) {
            response_code = SL_BT_OTS_OACP_RESPONSE_CODE_INVALID_PARAMETER;
            break;
          }
        }
        // Check if the offset is outside object data
        if (oacp_msg_parameters.calculate_checksum.offset
            > client->current_object_size->current_size) {
          response_code = SL_BT_OTS_OACP_RESPONSE_CODE_INVALID_PARAMETER;
          break;
        }
        // Assign patching request
        patching_requested = ((oacp_msg_parameters.write.offset > 0)
                              || (oacp_msg_parameters.write.length
                                  < client->current_object_size->allocated_size
                                  && !truncation_requested));
      }

      // Check if patching is requested but not allowed for this server
      if (patching_requested
          && (server->features.oacp_features
              & SL_BT_OTS_OACP_FEATURE_PATCHING_OF_OBJECTS_SUPPORTED_MASK)) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        break;
      }

      // Handle properties
      if (client->current_object_properties != NULL) {
        sl_bt_ots_object_properties_t properties = *client->current_object_properties;
        // Check if it is not writable
        if ( !(properties & SL_BT_OTS_OBJECT_PROPERTY_WRITE_MASK) ) {
          response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
          break;
        }
        // Check if truncate is requested but not allowed in the properties
        if (!(properties & SL_BT_OTS_OBJECT_PROPERTY_TRUNCATE_MASK)
            && truncation_requested) {
          response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
          break;
        }
        // Check if patching requested but not allowed in the properties
        if (patching_requested
            && !(properties & SL_BT_OTS_OBJECT_PROPERTY_PATCH_MASK)) {
          response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
          break;
        }
      }

      // Check if it is used in another transfer on the server
      if (transfer_is_in_progress(server, &client->current_object)) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_OBJECT_LOCKED;
      }

      break;

    case SL_BT_OTS_OACP_OPCODE_ABORT:
      if ((server->features.oacp_features
           & (SL_BT_OTS_OACP_FEATURE_ABORT_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OACP_RESPONSE_CODE_PROCEDURE_NOT_PERMITTED;
        break;
      }

      // Parameter length does are incorrect
      if (write_request->value.len != OACP_MESSAGE_LENGTH_ABORT) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }

      break;

    default:
      response_code = SL_BT_OTS_OACP_RESPONSE_CODE_OP_CODE_NOT_SUPPORTED;
      break;
  }

  // Execute OP code
  if (server->callbacks->on_oacp_event != NULL
      && response_code == SL_BT_OTS_OACP_RESPONSE_CODE_SUCCESS
      && sc == ATT_ERR_SUCCESS) {
    uint32_t  max_pdu_suggested = 0;
    uint32_t  max_sdu_suggested = 0;

    // Default values for max_pdu, max_sdu based on data length
    if (oacp_msg->opcode == SL_BT_OTS_OACP_OPCODE_READ) {
      max_pdu_suggested = oacp_msg_parameters.read.length;
      max_sdu_suggested = oacp_msg_parameters.read.length;
    } else if (oacp_msg->opcode == SL_BT_OTS_OACP_OPCODE_WRITE) {
      max_pdu_suggested = oacp_msg_parameters.write.length;
      max_sdu_suggested = oacp_msg_parameters.write.length;
    }

    // Precheck in-out params
    if (max_pdu_suggested > OTS_L2CAP_MAX_PDU) {
      max_pdu_suggested = OTS_L2CAP_MAX_PDU;
    }
    if (max_sdu_suggested > OTS_L2CAP_MAX_SDU) {
      max_sdu_suggested = OTS_L2CAP_MAX_SDU;
    }

    // check relative value
    if ((max_pdu_suggested + OTS_L2CAP_SDU_PDU_DIFF) > max_sdu_suggested) {
      max_sdu_suggested = max_pdu_suggested + OTS_L2CAP_SDU_PDU_DIFF;
    }

    // Suggest a PDU and SDU
    uint16_t max_pdu = max_pdu_suggested;
    uint16_t max_sdu = max_sdu_suggested;

