espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
    response_code = server->callbacks->on_oacp_event(server,
                                                     client->connection_handle,
                                                     &client->current_object,
                                                     oacp_msg->opcode,
                                                     &oacp_msg_parameters,
                                                     &oacp_response_data,
                                                     &max_sdu,
                                                     &max_pdu);
    // Check values
    if (max_pdu > OTS_L2CAP_MAX_PDU || max_pdu == 0) {
      max_pdu = OTS_L2CAP_MAX_PDU;
    }
    if (max_sdu > OTS_L2CAP_MAX_SDU || max_sdu == 0) {
      max_sdu = OTS_L2CAP_MAX_SDU;
    }
    // check relative value
    if ((max_pdu + OTS_L2CAP_SDU_PDU_DIFF) > max_sdu) {
      max_sdu = max_pdu + OTS_L2CAP_SDU_PDU_DIFF;
    }

    // Trigger an L2CAP transfer for Read or Write only if it is requested by
    // higher layers
    if (response_code == SL_BT_OTS_OACP_RESPONSE_CODE_SUCCESS
        && (oacp_msg->opcode == SL_BT_OTS_OACP_OPCODE_READ
            || oacp_msg->opcode == SL_BT_OTS_OACP_OPCODE_WRITE)) {
      client->l2cap_transfer.connection = client->connection_handle;
      if (oacp_msg->opcode == SL_BT_OTS_OACP_OPCODE_WRITE) {
        // Write case
        client->l2cap_transfer.mode = SL_BT_L2CAP_TRANSFER_MODE_RECEIVE;
        client->l2cap_transfer.data_length = oacp_msg_parameters.write.length;
        client->l2cap_transfer.data_offset = oacp_msg_parameters.write.offset;
      } else {
        // Read case
        client->l2cap_transfer.mode = SL_BT_L2CAP_TRANSFER_MODE_TRANSMIT;
        client->l2cap_transfer.data_length = oacp_msg_parameters.read.length;
        client->l2cap_transfer.data_offset = oacp_msg_parameters.read.offset;
      }

      client->l2cap_transfer.max_pdu = max_pdu;
      client->l2cap_transfer.max_sdu = max_sdu;

      client->l2cap_transfer.credit = 1;

      sc = sl_bt_l2cap_transfer_start_data_transfer(&client->l2cap_transfer,
                                                    false);
    }

    if (oacp_msg->opcode == SL_BT_OTS_OACP_OPCODE_EXECUTE) {
      oacp_response_data_len = oacp_response_data.execute.len;

      memcpy(&oacp_response_msg->data,
             oacp_response_data.execute.data,
             oacp_response_data_len);
    } else if (oacp_msg->opcode == SL_BT_OTS_OACP_OPCODE_CALCULATE_CHECKSUM) {
      oacp_response_data_len = sizeof(oacp_response_data.checksum);

      memcpy(&oacp_response_msg->data,
             (uint8_t *)&oacp_response_data.checksum,
             oacp_response_data_len);
    }
  }

  oacp_response_msg->response_opcode = SL_BT_OTS_OACP_OPCODE_RESPONSE_CODE;
  oacp_response_msg->opcode = oacp_msg->opcode;
  oacp_response_msg->response = response_code;

  if (sc == ATT_ERR_SUCCESS) {
    (void)sl_bt_gatt_server_send_user_write_response(write_request->connection,
                                                     write_request->characteristic,
                                                     sc);
    send_indication(client,
                    client->connection_handle,
                    server->gattdb_handles->characteristics.handles.object_action_control_point,
                    sizeof(oacp_response_msg->opcode)
                    + sizeof(oacp_response_msg->opcode)
                    + sizeof(oacp_response_msg->response)
                    + oacp_response_data_len,
                    (uint8_t *)oacp_response_msg);

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
    if (oacp_response_msg->response == SL_BT_OTS_OACP_RESPONSE_CODE_SUCCESS
        && server->capabilities.capability_object_changed) {
      // Send indications to clients
      switch (oacp_response_msg->opcode) {
        case SL_BT_OTS_OACP_OPCODE_CREATE:
          (void)send_object_changed(server,
                                    &client->current_object,
                                    SL_BT_OTS_OBJECT_CHANGE_SOURCE_MASK
                                    | SL_BT_OTS_OBJECT_CHANGE_CREATION_MASK,
                                    client->connection_handle);
          break;
        case SL_BT_OTS_OACP_OPCODE_DELETE:
          (void)send_object_changed(server,
                                    &client->current_object,
                                    SL_BT_OTS_OBJECT_CHANGE_SOURCE_MASK
                                    | SL_BT_OTS_OBJECT_CHANGE_DELETION_MASK,
                                    client->connection_handle);
          break;
        default:
          break;
      }
    }
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
  }

  return sc;
}

static sl_status_t send_indication(sl_bt_ots_server_client_db_entry_t *client_entry,
                                   uint8_t                            connection,
                                   uint16_t                           characteristic,
                                   size_t                             value_len,
                                   const uint8_t                      *value)
{
  sl_status_t sc;
  // Try to indicate the client
  sc = sl_bt_gatt_server_send_indication(connection,
                                         characteristic,
                                         value_len,
                                         value);
  if (sc == SL_STATUS_IN_PROGRESS) {
    // Could not indicate now, save to the queue
    indication_queue_item_t item;
    item.connection = connection;
    item.gattdb_handle = characteristic;
    item.data_length = value_len;
    memcpy(item.data, value, value_len);
    sc = app_queue_add(&client_entry->indication_queue, (uint8_t *)&item);
  }

  return sc;
}

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS
static uint8_t handle_olcp_write(sl_bt_ots_server_t *server,
                                 sl_bt_ots_server_client_db_entry_t *client,
                                 sl_bt_evt_gatt_server_user_write_request_t *write_request)
{
  uint8_t sc = ATT_ERR_SUCCESS;

  sl_bt_ots_olcp_response_code_t response_code = SL_BT_OTS_OLCP_RESPONSE_CODE_SUCCESS;
  uint8_t response_code_len = sizeof(sl_bt_ots_olcp_opcode_t)
                              + sizeof(sl_bt_ots_olcp_opcode_t)
                              + sizeof(sl_bt_ots_olcp_response_code_t);

  sl_bt_ots_olcp_message_t *olcp_msg = ((sl_bt_ots_olcp_message_t *)write_request->value.data);
  sl_bt_ots_olcp_parameters_t olcp_msg_parameters;

  // Buffer to initialize response message
  uint8_t buffer[sizeof(sl_bt_ots_olcp_response_message_t)];
  // Used for BLE indication message
  sl_bt_ots_olcp_response_message_t *olcp_response_msg = (sl_bt_ots_olcp_response_message_t *)buffer;
  // Object is not selected

  if (!client->subscription_status.subscribed.olcp) {
    sc = ATT_ERR_IMPORER_CCCD;
    return sc;
  }

  if (!check_object_valid(&client->current_object)
      && (olcp_msg->opcode == SL_BT_OTS_OLCP_OPCODE_PREVIOUS
          || olcp_msg->opcode == SL_BT_OTS_OLCP_OPCODE_NEXT)) {
    sc = ATT_ERR_OBJECT_NOT_SELECTED;
    return sc;
  }

  uint8_t *data_pointer = (uint8_t *)&olcp_msg->opcode;

