espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
  switch (olcp_msg->opcode) {
    case SL_BT_OTS_OLCP_OPCODE_FIRST:
    case SL_BT_OTS_OLCP_OPCODE_LAST:
    case SL_BT_OTS_OLCP_OPCODE_PREVIOUS:
    case SL_BT_OTS_OLCP_OPCODE_NEXT:
      if (write_request->value.len != sizeof(sl_bt_ots_olcp_opcode_t)) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
      }
      break;

    case SL_BT_OTS_OLCP_OPCODE_GO_TO:
      if (write_request->value.len != OLCP_MESSAGE_LENGTH_GO_TO) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }
      if ((server->features.olcp_features
           & (SL_BT_OTS_OLCP_FEATURE_GO_TO_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OLCP_RESPONSE_CODE_OP_CODE_NOT_SUPPORTED;
        break;
      }

      data_pointer += sizeof(sl_bt_ots_olcp_opcode_t);
      memcpy(&olcp_msg_parameters.go_to.id,
             data_pointer,
             sizeof(olcp_msg_parameters.go_to.id));
      break;

    case SL_BT_OTS_OLCP_OPCODE_ORDER:
      if (write_request->value.len != OLCP_MESSAGE_LENGTH_ORDER) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }
      if ((server->features.olcp_features
           & (SL_BT_OTS_OLCP_FEATURE_ORDER_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OLCP_RESPONSE_CODE_OP_CODE_NOT_SUPPORTED;
        break;
      }
      data_pointer += sizeof(sl_bt_ots_olcp_opcode_t);

      switch (*(sl_bt_ots_list_sort_order_t *)data_pointer) {
        case SL_BT_OTS_LIST_SORT_ORDER_NAME_ASC:
        case SL_BT_OTS_LIST_SORT_ORDER_TYPE_ASC:
        case SL_BT_OTS_LIST_SORT_ORDER_CURRENT_SIZE_ASC:
        case SL_BT_OTS_LIST_SORT_ORDER_FIRST_CREATED_ASC:
        case SL_BT_OTS_LIST_SORT_ORDER_LAST_MODIFIED_ASC:
        case SL_BT_OTS_LIST_SORT_ORDER_NAME_DESC:
        case SL_BT_OTS_LIST_SORT_ORDER_TYPE_DESC:
        case SL_BT_OTS_LIST_SORT_ORDER_CURRENT_SIZE_DESC:
        case SL_BT_OTS_LIST_SORT_ORDER_FIRST_CREATED_DESC:
        case SL_BT_OTS_LIST_SORT_ORDER_LAST_MODIFIED_DESC:
          break;
        default:
          response_code = SL_BT_OTS_OLCP_RESPONSE_CODE_INVALID_PARAMETER;
          break;
      }

      olcp_msg_parameters.order.list_sort_order = *(sl_bt_ots_list_sort_order_t *)data_pointer;
      break;

    case SL_BT_OTS_OLCP_OPCODE_REQUEST_NUMBER_OF_OBJECTS:
      if (write_request->value.len != sizeof(sl_bt_ots_olcp_opcode_t)) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }
      if ((server->features.olcp_features
           & (SL_BT_OTS_OLCP_FEATURE_REQUEST_NUMBER_OF_OBJECTS_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OLCP_RESPONSE_CODE_OP_CODE_NOT_SUPPORTED;
        break;
      }
      response_code_len += sizeof(olcp_response_msg->number_of_objects);
      break;

    case SL_BT_OTS_OLCP_OPCODE_CLEAR_MARKING:
      if (write_request->value.len != sizeof(sl_bt_ots_olcp_opcode_t)) {
        sc = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        break;
      }
      if ((server->features.olcp_features
           & (SL_BT_OTS_OLCP_FEATURE_CLEAR_MARKING_OP_CODE_SUPPORTED_MASK)) == 0) {
        response_code = SL_BT_OTS_OLCP_RESPONSE_CODE_OP_CODE_NOT_SUPPORTED;
        break;
      }
      break;

    default:
      response_code = SL_BT_OTS_OLCP_RESPONSE_CODE_OP_CODE_NOT_SUPPORTED;
  }

  uint32_t number_of_objects = 0;
  // Execute OP code
  if (server->callbacks->on_olcp_event != NULL
      && response_code == SL_BT_OTS_OLCP_RESPONSE_CODE_SUCCESS
      && sc == ATT_ERR_SUCCESS) {
    response_code = server->callbacks->on_olcp_event(server,
                                                     client->connection_handle,
                                                     &client->current_object,
                                                     olcp_msg->opcode,
                                                     &olcp_msg_parameters,
                                                     &number_of_objects);
    olcp_response_msg->number_of_objects = number_of_objects;
  }

  olcp_response_msg->response_opcode = SL_BT_OTS_OLCP_OPCODE_RESPONSE_CODE;
  olcp_response_msg->opcode = olcp_msg->opcode;
  olcp_response_msg->response = response_code;

  if (sc == ATT_ERR_SUCCESS) {
    (void)sl_bt_gatt_server_send_user_write_response(write_request->connection,
                                                     write_request->characteristic,
                                                     sc);
    send_indication(client,
                    client->connection_handle,
                    server->gattdb_handles->characteristics.handles.object_list_control_point,
                    response_code_len,
                    (uint8_t *)olcp_response_msg);
  }

  return sc;
}
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT
static uint8_t handle_filter_write(sl_bt_ots_server_t *server,
                                   sl_bt_ots_server_client_db_entry_t *client,
                                   sl_bt_evt_gatt_server_user_write_request_t *write_request)
{
  uint8_t att_error = ATT_ERR_SUCCESS;
  sl_bt_ots_object_list_filter_content_t content;
  bool filter_is_valid = false;

  if (write_request->value.len >= 1) {
    // Get filter type
    content.filter_type = *((sl_bt_ots_object_list_filter_type_t *)write_request->value.data);
    uint8_t parameter_length = write_request->value.len - 1;

    switch (content.filter_type) {
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NO_FILTER:
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_MARKED_OBJECTS:
        if (parameter_length == 0) {
          filter_is_valid = true;
        } else {
          att_error = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        }
        break;
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NAME_CONTAINS:
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NAME_STARTS_WITH:
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NAME_ENDS_WITH:
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_NAME_IS_EXACTLY:
        content.parameters.name.length = parameter_length;
        content.parameters.name.name   = (char *)&(write_request->value.data[1]);
        filter_is_valid = true;
        break;
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_CREATED_BETWEEN:
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_MODIFIED_BETWEEN:
#endif
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT || SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
        if (parameter_length == sizeof(sl_bt_ots_object_list_filter_time_parameters_t)) {
          memcpy(content.parameters.time.from.data, &(write_request->value.data[1]), parameter_length);
          if (content.parameters.time.from.time.year > content.parameters.time.to.time.year) {
            att_error = ATT_ERR_WRITE_REQUEST_REJECTED;
            break;
          } else if (content.parameters.time.from.time.year == content.parameters.time.to.time.year) {
            for (uint8_t i = sizeof(content.parameters.time.from.time.year); i < sizeof(sl_bt_ots_time_t); i++) {
              if (content.parameters.time.from.data[i] > content.parameters.time.to.data[i]) {
                att_error = ATT_ERR_WRITE_REQUEST_REJECTED;
                break;
              } else if (content.parameters.time.from.data[i] < content.parameters.time.to.data[i]) {
                break;
              }
            }
          }
          if (att_error == ATT_ERR_SUCCESS) {
            filter_is_valid = true;
          }
        } else {
          att_error = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        }
        break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT || SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_OBJECT_TYPE:
        if (parameter_length == SL_BT_OTS_UUID_SIZE_16
            || parameter_length == SL_BT_OTS_UUID_SIZE_128) {
          content.parameters.type.uuid_is_sig = (parameter_length == SL_BT_OTS_UUID_SIZE_16);
          content.parameters.type.uuid_data = &write_request->value.data[1];
          filter_is_valid = true;
        } else {
          att_error = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        }
        break;
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_CURRENT_SIZE_BETWEEN:
      case SL_BT_OTS_OBJECT_LIST_FILTER_TYPE_ALLOCATED_SIZE_BETWEEN:
        if (parameter_length == sizeof(sl_bt_ots_object_list_filter_size_parameters_t)) {
          memcpy(&content.parameters.size, &write_request->value.data[1], parameter_length);
          if (content.parameters.size.min > content.parameters.size.max) {
            att_error = ATT_ERR_WRITE_REQUEST_REJECTED;
          } else {
            filter_is_valid = true;
          }
        } else {
          att_error = ATT_ERR_INVALID_ATTRIBUTE_LEN;
        }
        break;
      default:
        att_error = ATT_ERR_WRITE_REQUEST_REJECTED;
        break;
    }
  } else {
    att_error = ATT_ERR_INVALID_ATTRIBUTE_LEN;
  }

  // Call back on success
  if (att_error == ATT_ERR_SUCCESS) {
    if (server->callbacks->on_object_list_filter_set != NULL
        && filter_is_valid) {
      sl_bt_ots_object_metadata_write_response_code_t result =
        server->callbacks->on_object_list_filter_set(server,
                                                     client->connection_handle,
                                                     &content);
      // Use result as ATT error code
      att_error = (uint8_t)result;
    }
  }

  if (att_error == ATT_ERR_SUCCESS) {
    (void)sl_bt_gatt_server_send_user_write_response(write_request->connection,
                                                     write_request->characteristic,
                                                     att_error);
  }
  return att_error;
}
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT

