espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ots/src/sl_bt_ots_server.c
static uint8_t handle_metadata_write(sl_bt_ots_server_t *server,
                                     sl_bt_ots_server_client_db_entry_t *client,
                                     sl_bt_ots_characteristic_uuid_index characteristic_index,
                                     sl_bt_evt_gatt_server_user_write_request_t *write_request)
{
  uint8_t att_error = ATT_ERR_SUCCESS;
  sl_bt_ots_object_metadata_write_parameters_t data;
  sl_bt_ots_object_metadata_write_parameters_t *data_ptr;
  // Check and create callback arguments
  switch (characteristic_index) {
    // Handle metadata write
    case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_NAME:
      data.object_name.length = write_request->value.len;
      data.object_name.name = (char *)write_request->value.data;
      data_ptr = &data;
      break;
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
    case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_FIRST_CREATED:
      if (write_request->value.len == sizeof(sl_bt_ots_object_first_created_t)) {
        data_ptr = (sl_bt_ots_object_metadata_write_parameters_t *)write_request->value.data;
      } else {
        att_error = ATT_ERR_INVALID_ATTRIBUTE_LEN;
      }
      break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
    case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_LAST_MODIFIED:
      if (write_request->value.len == sizeof(sl_bt_ots_object_last_modified_t)) {
        data_ptr = (sl_bt_ots_object_metadata_write_parameters_t *)write_request->value.data;
      } else {
        att_error = ATT_ERR_INVALID_ATTRIBUTE_LEN;
      }
      break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
    case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_PROPERTIES:
      if (write_request->value.len == sizeof(sl_bt_ots_object_properties_t)) {
        data_ptr = (sl_bt_ots_object_metadata_write_parameters_t *)write_request->value.data;
      } else {
        att_error = ATT_ERR_INVALID_ATTRIBUTE_LEN;
      }
      break;
    default:
      att_error = ATT_ERR_ATTRIBUTE_NOT_FOUND;
      break;
  }

  // Call back on success
  if (att_error == ATT_ERR_SUCCESS) {
    // Check if an object is selected
    if (!check_object_valid(&client->current_object)) {
      att_error = ATT_ERR_OBJECT_NOT_SELECTED;
    } else {
      if (server->callbacks->on_object_metadata_write != NULL) {
        sl_bt_ots_object_metadata_write_response_code_t result =
          server->callbacks->on_object_metadata_write(server,
                                                      client->connection_handle,
                                                      &server->client_db->current_object,
                                                      (sl_bt_ots_object_metadata_write_event_type_t)characteristic_index,
                                                      data_ptr);
        // Use result as ATT error code
        att_error = (uint8_t)result;
      }
    }
  }
  if (att_error == ATT_ERR_SUCCESS) {
    (void)sl_bt_gatt_server_send_user_write_response(write_request->connection,
                                                     write_request->characteristic,
                                                     att_error);
  }
  return att_error;
}

static void handle_gatt_write(sl_bt_evt_gatt_server_user_write_request_t *write_request)
{
  sl_bt_ots_server_t *server = NULL;
  sl_bt_ots_server_client_db_entry_t *client = NULL;
  sl_bt_ots_characteristic_uuid_index characteristic_index = SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_INVALID;
  uint8_t att_error = ATT_ERR_SUCCESS;

  // Find characteristic handle
  characteristic_index = find_characteristic_index(write_request->characteristic,
                                                   &server);
  // Check server hand characteristic index
  if (server != NULL
      && characteristic_index != SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_INVALID) {
    // Identify client
    client = find_client(server, write_request->connection);

    // handle writes if client was found
    if (client != NULL) {
      // Check and create callback arguments
      switch (characteristic_index) {
        // Handle OACP
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OACP:
          att_error = handle_oacp_write(server,
                                        client,
                                        write_request);
          break;
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS
        // Handle OLCP
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OLCP:
          if (server->capabilities.capability_multiple_objects) {
            att_error = handle_olcp_write(server,
                                          client,
                                          write_request);
          } else {
            att_error = ATT_ERR_NOT_SUPPORTED;
          }
          break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS
        // Handle metadata write
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_NAME:
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_FIRST_CREATED:
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_FIRST_CREATED_SUPPORT
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_LAST_MODIFIED:
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_TIME_LAST_MODIFIED_SUPPORT
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_PROPERTIES:
          att_error = handle_metadata_write(server,
                                            client,
                                            characteristic_index,
                                            write_request);

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
          if (att_error == SL_BT_OTS_OBJECT_METADATA_WRITE_RESPONSE_CODE_SUCCESS
              && server->capabilities.capability_object_changed) {
            // Send indications to clients
            (void)send_object_changed(server,
                                      &client->current_object,
                                      SL_BT_OTS_OBJECT_CHANGE_SOURCE_MASK
                                      | SL_BT_OTS_OBJECT_CHANGE_METADATA_MASK,
                                      client->connection_handle);
          }
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
          break;
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT
        // Handle Object List filter write
        case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_LIST_FILTER:
          if (server->capabilities.capability_object_list_filter) {
            att_error = handle_filter_write(server,
                                            client,
                                            write_request);
          } else {
            att_error = ATT_ERR_NOT_SUPPORTED;
          }
          break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_LIST_FILTER_SUPPORT
        default:
          att_error = ATT_ERR_ATTRIBUTE_NOT_FOUND;
          break;
      }
    } else {
      // Client not found, respond with Concurrency Limit Exceeded.
      att_error = ATT_ERR_CONCURRENCY_LIMIT_EXCEEDED;
    }
  }
  if (att_error != ATT_ERR_SUCCESS) {
    // Send response to write
    (void)sl_bt_gatt_server_send_user_write_response(write_request->connection,
                                                     write_request->characteristic,
                                                     att_error);
  }
}

static void handle_cccd(sl_bt_evt_gatt_server_characteristic_status_t *characteristic_status)
{
  sl_bt_ots_server_t *server = NULL;
  if (sl_bt_gatt_server_client_config == characteristic_status->status_flags ) {
    sl_bt_ots_characteristic_uuid_index characteristic_index
      = find_characteristic_index(characteristic_status->characteristic,
                                  &server);
    bool value = (sl_bt_gatt_indication & characteristic_status->client_config_flags) > 0;
    if (server != NULL
        && characteristic_index != SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_INVALID) {
      sl_bt_ots_server_client_db_entry_t *client = find_client(server,
                                                               characteristic_status->connection);
      bool changed = false;
      if (client != NULL) {
        switch (characteristic_index) {
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OACP:
            client->subscription_status.subscribed.oacp = value;
            changed = true;
            break;
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OLCP:
            if (server->capabilities.capability_multiple_objects) {
              client->subscription_status.subscribed.olcp = value;
              changed = true;
            }
            break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_MULTIPLE_OBJECTS
#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
          case SL_BT_OTS_CHARACTERISTIC_UUID_INDEX_OBJECT_CHANGED:
            if (server->capabilities.capability_object_changed) {
              client->subscription_status.subscribed.object_changed = value;
              changed = true;
            }
            break;
#endif // SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
          default:
            break;
        }
        if (changed) {
          CALL_SAFE(server,
                    on_client_subscription_change,
                    server,
                    characteristic_status->connection,
                    client->subscription_status);
        }
      }
    }
  }
}

#if SL_BT_OTS_SERVER_CONFIG_GLOBAL_OBJECT_CHANGED_SUPPORT
static sl_status_t send_object_changed(sl_bt_ots_server_handle_t        server,
                                       sl_bt_ots_object_id_t            *object,
                                       sl_bt_ots_object_changed_flags_t flags,
                                       uint16_t                         client)
{
  sl_status_t sc = SL_STATUS_OK;
  uint8_t i;
  // Check input
  CHECK_NULL(server);
  CHECK_NULL(object);

  sl_bt_ots_object_changed_content_t indication_content;

  bool client_initiated = ((flags & SL_BT_OTS_OBJECT_CHANGE_SOURCE_MASK) > 0);

  for (i = 0; i < server->concurrency; i++) {
    if ( (!client_initiated)
         || (client != server->client_db[i].connection_handle) ) {
      if (server->client_db[i].subscription_status.subscribed.object_changed) {
        // Arrange data to send
        indication_content.flags = flags;
        memcpy(indication_content.object.data,
               object->data,
               SL_BT_OTS_OBJECT_ID_SIZE);
        sc |= send_indication(&server->client_db[i],
                              server->client_db[i].connection_handle,
                              server->gattdb_handles->characteristics.handles.object_changed,
                              sizeof(indication_content),
                              (uint8_t *)&indication_content);
      }
    }
  }

  return sc;
}
#endif

static void clear_queue(uint8_t connection)
{
  CORE_DECLARE_IRQ_STATE;

  CORE_ENTER_CRITICAL();
  for (uint8_t s = 0; s < SL_BT_OTS_SERVER_COUNT; s++) {
    const sl_bt_ots_server_t *server = sl_bt_ots_server_instances[s];
    for (uint8_t index = 0; index < server->concurrency; index++) {
      if (connection == server->client_db[index].connection_handle) {
        // Reinit queue
        app_queue_t *queue = &server->client_db[index].indication_queue;
        app_queue_init(queue, queue->size, queue->item_size, queue->data);
      }
    }
  }
  CORE_EXIT_CRITICAL();
}

static bool transfer_is_in_progress(sl_bt_ots_server_handle_t        server,
                                    sl_bt_ots_object_id_t            *object)
{
  sl_status_t sc = SL_STATUS_OK;

  for (uint8_t index = 0; index < server->concurrency; index++) {
    // Check if it is the same object as specified
    if (memcmp(server->client_db[index].current_object.data, object->data, sizeof(object->data)) == 0) {
      // Check if the transfer is in progress
      sc = sl_bt_l2cap_transfer_check_progress(&server->client_db[index].l2cap_transfer);
      if (sc == SL_STATUS_IN_PROGRESS) {
        return (sc == SL_STATUS_IN_PROGRESS);
      }
    }
  }
  return (sc == SL_STATUS_IN_PROGRESS);
}
